package step2;


public class Intro {

    void intro1() {
        System.out.println("┌===============================================================┐");
          System.out.println("고대 왕국의 깊은 산속에는 수세기 동안 잠들어 있는 전설적인 던전이 있습니다.");
          System.out.println("");
          System.out.println("이 던전에는 무수한 보물과 강력한 마법 아이템이 숨겨져 있지만,");
          System.out.println("");
          System.out.println("동시에 강력한 괴물들과 치명적인 함정들도 도사리고 있습니다.");
          System.out.println("");
          System.out.println("수많은 모험가들이 던전에 도전했지만, 그 중 거의 대부분은 돌아오지 못했습니다.");
          System.out.println("└==============================================================┘");
      
         
     }

    void intro2() {
        System.out.println("┌===============================================================┐");
          System.out.println("용사는 던전 진입을 결심합니다. 그러나 숲 속에는 이상한 생명체와 신비로운 함정이 많이 존재합니다.");
          System.out.println("");
          System.out.println("용사는 던전 비밀을 해독하고, 자신이 숨겨진 보물에 접근할 수 있는 방법을 찾아야 합니다.");
          System.out.println("└===============================================================┘");
     }

      
      
    void intro3() {
       System.out.println("======================== 기본적인 룰북 ============================");
       System.out.println(" 1. 스테이지 선택지2개. 각 스테이지를 격파하며 아이템을 모아 스탯 레벨업을 합니다.");
       System.out.println(" 2. 전투시 3가지 기본선택지 1)공격 2)회복하기(60%확률로 회복) 3) 도망가기(50%확률로 도망, 스탯 패널티있음)");
       System.out.println(" 3. 체력이 0이 되면 게임패배.");
       System.out.println(" 4. 아이템으로 스탯레벨업하고 최종보스(마왕)잡으면 게임승리");
       System.out.println("===============================================================");
       
    }
         void start() {
             
              System.out.println("  _______  _______    ______    _______   _______  ");
              System.out.println(" (  ____ \\ \\__   __/  (  __  \\  (  _ \\___   __/_ ");
              System.out.println(" | (    \\/    ) (     | (  \\  ) | (   ) |  )  (    ");
              System.out.println(" | (_____     | |     | |   ) | | (___) |    |  |    ");
              System.out.println(" (_____  )    | |     | |===| | |  ___  |    |  |    ");
              System.out.println("       ) |    | |     | |   ||| |  )  ( |    |  |  ");
              System.out.println(" /\\____) |    | |    | (   | | || )  ( |    |  |    ");
              System.out.println(" \\_______)    \\_/   | |   | | | |/  \\|    \\_/    ");
          }

         

         
         
         
     
     


void logo() {
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒■■■■■■■■■■■■■■■■■■■■■■■■▒▒▒▒▒■▒■▒▒▒▒■■■■■■■▒▒▒▒▒▒▒▒▒▒▒■■■▒▒▒▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒■■▒▒▒▒▒■■▒▒▒▒▒▒▒▒▒■■▒▒▒▒▒■▒■▒▒▒■▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒▒▒■▒■▒▒▒▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒■▒▒■▒▒▒■▒▒■▒▒▒▒■■■■■■▒▒▒▒▒■▒■▒▒■▒▒▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒■▒▒▒■▒▒▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒■▒▒▒▒■▒■▒▒▒▒■▒▒▒■■▒▒▒▒▒▒■■■■▒■▒▒▒■▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒■▒▒▒▒▒■▒▒▒■■■▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒■■■▒▒▒▒▒▒▒▒■■▒▒▒▒▒▒▒▒▒■▒■▒▒▒▒■■■■■■■▒▒▒▒▒▒▒▒■▒▒▒▒▒▒▒■▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒■■■■■■■■■■■■■■■■■■■■■■■■■■■▒▒▒■▒■▒▒▒▒▒■▒▒▒■▒▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒▒■▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒▒▒▒▒■▒▒▒■▒■■■■■■■■■■■■■■■■■▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■■■■■■■■▒▒▒■▒■▒▒▒▒▒■■■■■■■▒▒▒▒▒▒▒■▒■▒■▒■▒■▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒▒▒▒▒■▒▒▒■▒■▒▒▒▒■▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■■■■■■■■▒▒▒■▒■▒▒▒■▒▒▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒▒▒▒▒■▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒■▒■▒■▒■▒▒■▒▒▒▒▒▒▒■■■■■■■▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒■▒▒▒▒■■■■■■■■■■■■■■▒▒▒▒▒▒▒▒▒▒▒■▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒■▒■▒■▒■▒▒■▒▒▒▒▒▒▒▒▒▒■■▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒■▒▒▒▒▒▒▒▒▒▒■■▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒■▒▒▒▒▒▒▒▒▒▒■■▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒■▒▒▒▒▒▒▒▒▒▒■■▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒■▒▒■▒▒▒▒▒▒▒▒▒▒■■▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒");
      System.out.println("▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒");
}



}
